benchmark_result/bench_result_hadware_evol/fio/xen_4_11_0/vm0/fio_result/round9/rand_read_throughput
rand_read_throughput: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=64
...
fio-3.1
Starting 4 processes

rand_read_throughput: (groupid=0, jobs=4): err= 0: pid=19244: Wed Jun 19 05:25:57 2024
   read: IOPS=2491, BW=2496MiB/s (2617MB/s)(146GiB/60017msec)
    slat (usec): min=81, max=39686, avg=1371.57, stdev=2823.30
    clat (usec): min=35, max=474723, avg=101091.20, stdev=60417.69
     lat (usec): min=903, max=477694, avg=102506.36, stdev=61035.82
    clat percentiles (msec):
     |  1.00th=[   27],  5.00th=[   28], 10.00th=[   34], 20.00th=[   48],
     | 30.00th=[   57], 40.00th=[   69], 50.00th=[   88], 60.00th=[  108],
     | 70.00th=[  129], 80.00th=[  155], 90.00th=[  186], 95.00th=[  213],
     | 99.00th=[  271], 99.50th=[  292], 99.90th=[  363], 99.95th=[  384],
     | 99.99th=[  443]
   bw (  KiB/s): min=172722, max=2056241, per=25.03%, avg=639684.01, stdev=314144.96, samples=480
   iops        : min=  168, max= 2008, avg=624.37, stdev=306.75, samples=480
  lat (usec)   : 50=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.02%, 50=21.90%
  lat (msec)   : 100=34.10%, 250=42.28%, 500=1.86%
  cpu          : usr=6.32%, sys=38.26%, ctx=56641, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=103.5%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=149560,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=2496MiB/s (2617MB/s), 2496MiB/s-2496MiB/s (2617MB/s-2617MB/s), io=146GiB (157GB), run=60017-60017msec

Disk stats (read/write):
  xvda: ios=1240615/8, merge=0/4, ticks=1281744/16, in_queue=1194664, util=98.99%